nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/driver_examples/sramc/sram_emulator/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitFlexioPins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* D0-D15*/
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00, /* GPIO_EMC_B1_00 is configured as FLEXIO2_FLEXIO00 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_00 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_01_FLEXIO1_FLEXIO01, /* GPIO_EMC_B1_01 is configured as FLEXIO2_FLEXIO01 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_01 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02, /* GPIO_EMC_B1_02 is configured as FLEXIO2_FLEXIO02 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_02 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_03_FLEXIO1_FLEXIO03, /* GPIO_EMC_B1_03 is configured as FLEXIO2_FLEXIO03 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_03 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_04_FLEXIO1_FLEXIO04, /* GPIO_EMC_B1_04 is configured as FLEXIO2_FLEXIO04 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_04 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_05_FLEXIO1_FLEXIO05, /* GPIO_EMC_B1_05 is configured as FLEXIO2_FLEXIO05 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_05 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_06_FLEXIO1_FLEXIO06, /* GPIO_EMC_B1_06 is configured as FLEXIO2_FLEXIO06 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_06 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_07_FLEXIO1_FLEXIO07, /* GPIO_EMC_B1_07 is configured as FLEXIO2_FLEXIO07 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_07 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_08_FLEXIO1_FLEXIO08, /* GPIO_EMC_B1_08 is configured as FLEXIO2_FLEXIO08 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_08 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_09_FLEXIO1_FLEXIO09, /* GPIO_EMC_B1_09 is configured as FLEXIO2_FLEXIO09 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_09 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_10_FLEXIO1_FLEXIO10, /* GPIO_EMC_B1_10 is configured as FLEXIO2_FLEXIO10 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_10 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_11_FLEXIO1_FLEXIO11, /* GPIO_EMC_B1_11 is configured as FLEXIO2_FLEXIO11 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_11 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12, /* GPIO_EMC_B1_12 is configured as FLEXIO2_FLEXIO12 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_12 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_13_FLEXIO1_FLEXIO13, /* GPIO_EMC_B1_13 is configured as FLEXIO2_FLEXIO13 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_13 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_14_FLEXIO1_FLEXIO14, /* GPIO_EMC_B1_14 is configured as FLEXIO2_FLEXIO14 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_14 */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_15_FLEXIO1_FLEXIO15, /* GPIO_EMC_B1_15 is configured as FLEXIO2_FLEXIO15 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_15 */
  /* WE */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_16_FLEXIO1_FLEXIO16, /* GPIO_EMC_B1_16 is configured as FLEXIO2_FLEXIO16 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_16 */
  /* OE */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_17_FLEXIO1_FLEXIO17, /* GPIO_EMC_B1_17 is configured as FLEXIO2_FLEXIO17 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_17 */
  /* ADV */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_18_FLEXIO1_FLEXIO18, /* GPIO_EMC_B1_18 is configured as FLEXIO2_FLEXIO18 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_18 */
  /* CS */
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_19_FLEXIO1_FLEXIO19, /* GPIO_EMC_B1_19 is configured as FLEXIO2_FLEXIO19 */
                   1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_19 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00,     /* GPIO_EMC_B1_00 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_01_FLEXIO1_FLEXIO01,     /* GPIO_EMC_B1_01 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02,     /* GPIO_EMC_B1_02 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_03_FLEXIO1_FLEXIO03,     /* GPIO_EMC_B1_03 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_04_FLEXIO1_FLEXIO04,     /* GPIO_EMC_B1_04 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_05_FLEXIO1_FLEXIO05,     /* GPIO_EMC_B1_05 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_06_FLEXIO1_FLEXIO06,     /* GPIO_EMC_B1_06 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_07_FLEXIO1_FLEXIO07,     /* GPIO_EMC_B1_07 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_08_FLEXIO1_FLEXIO08,     /* GPIO_EMC_B1_08 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_09_FLEXIO1_FLEXIO09,     /* GPIO_EMC_B1_09 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_10_FLEXIO1_FLEXIO10,     /* GPIO_EMC_B1_10 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_11_FLEXIO1_FLEXIO11,     /* GPIO_EMC_B1_11 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,     /* GPIO_EMC_B1_12 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_13_FLEXIO1_FLEXIO13,     /* GPIO_EMC_B1_13 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_14_FLEXIO1_FLEXIO14,     /* GPIO_EMC_B1_14 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_15_FLEXIO1_FLEXIO15,     /* GPIO_EMC_B1_15 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_16_FLEXIO1_FLEXIO16,     /* GPIO_EMC_B1_16 PAD functional properties : */
      0x0AU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_17_FLEXIO1_FLEXIO17,     /* GPIO_EMC_B1_17 PAD functional properties : */
      0x0AU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_18_FLEXIO1_FLEXIO18,     /* GPIO_EMC_B1_18 PAD functional properties : */
      0x0AU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
